ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>PVD1CMPCR</name>
                    <description>Voltage Monitor 1 Comparator Control Register</description>
                    <addressOffset>0xA58</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0F</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>PVDLVL</name>
                            <description>Detection Voltage 1 Level Select(Standard voltage during drop in voltage)</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>4.29V (Vdetm_0) </description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001</name>
                                    <description>4.16V (Vdetm_1) </description>
                                    <value>#00001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00010</name>
                                    <description>4.03V (Vdetm_2) </description>
                                    <value>#00010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00011</name>
                                    <description>3.86V (Vdetm_3) </description>
                                    <value>#00011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00100</name>
                                    <description>3.14V (Vdetm_4) </description>
                                    <value>#00100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101</name>
                                    <description>3.10V (Vdetm_5) </description>
                                    <value>#00101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00110</name>
                                    <description>3.08V (Vdetm_6) </description>
                                    <value>#00110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00111</name>
                                    <description>2.85V (Vdetm_7) </description>
                                    <value>#00111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01000</name>
                                    <description>2.83V (Vdetm_8) </description>
                                    <value>#01000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01001</name>
                                    <description>2.80V (Vdetm_9) </description>
                                    <value>#01001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01010</name>
                                    <description>2.62V (Vdetm_10) </description>
                                    <value>#01010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01011</name>
                                    <description>2.33V (Vdetm_11) </description>
                                    <value>#01011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01100</name>
                                    <description>1.90V (Vdetm_12) </description>
                                    <value>#01100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01101</name>
                                    <description>1.86V (Vdetm_13) </description>
                                    <value>#01101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110</name>
                                    <description>1.74V (Vdetm_14) </description>
                                    <value>#01110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01111</name>
                                    <description>1.71V (Vdetm_15) </description>
                                    <value>#01111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>5</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVDE</name>
                            <description>Voltage Detection 1 Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage detection 1 circuit disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage detection 1 circuit enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVD2CMPCR</name>
                    <description>Voltage Monitor 2 Comparator Control Register</description>
                    <addressOffset>0xA5C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0F</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>PVDLVL</name>
                            <description>Detection Voltage 2 Level Select(Standard voltage during drop in voltage)</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>4.29V (Vdetm_0) </description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001</name>
                                    <description>4.16V (Vdetm_1) </description>
                                    <value>#00001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00010</name>
                                    <description>4.03V (Vdetm_2) </description>
                                    <value>#00010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00011</name>
                                    <description>3.86V (Vdetm_3) </description>
                                    <value>#00011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00100</name>
                                    <description>3.14V (Vdetm_4) </description>
                                    <value>#00100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101</name>
                                    <description>3.10V (Vdetm_5) </description>
                                    <value>#00101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00110</name>
                                    <description>3.08V (Vdetm_6) </description>
                                    <value>#00110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00111</name>
                                    <description>2.85V (Vdetm_7) </description>
                                    <value>#00111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01000</name>
                                    <description>2.83V (Vdetm_8) </description>
                                    <value>#01000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01001</name>
                                    <description>2.80V (Vdetm_9) </description>
                                    <value>#01001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01010</name>
                                    <description>2.62V (Vdetm_10) </description>
                                    <value>#01010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01011</name>
                                    <description>2.33V (Vdetm_11) </description>
                                    <value>#01011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01100</name>
                                    <description>1.90V (Vdetm_12) </description>
                                    <value>#01100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01101</name>
                                    <description>1.86V (Vdetm_13) </description>
                                    <value>#01101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110</name>
                                    <description>1.74V (Vdetm_14) </description>
                                    <value>#01110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01111</name>
                                    <description>1.71V (Vdetm_15) </description>
                                    <value>#01111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>5</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVDE</name>
                            <description>Voltage Detection 2 Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage detection 2 circuit disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage detection 2 circuit enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>PVD%sCR0</name>
                    <description>Voltage Monitor %s Circuit Control Register 0</description>
                    <addressOffset>0xA70</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x8A</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>RIE</name>
                            <description>Voltage Monitor  Interrupt/Reset Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DFDIS</name>
                            <description>Voltage Monitor Digital Filter Disable Mode Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enable digital filter</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disable digital filter</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPE</name>
                            <description>Voltage Monitor Circuit Comparison Result Output Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable voltage monitor 1 circuit comparison result output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable voltage monitor 1 circuit comparison result output.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 1. The write value should be 1.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSAMP</name>
                            <description>Sampling Clock Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1/2 LOCO frequency</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>1/4 LOCO frequency</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>1/8 LOCO frequency</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>1/16 LOCO frequency</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RI</name>
                            <description>Voltage Monitor Circuit Mode Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage Monitor  interrupt during Vdet1 passage</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage Monitor  reset enabled when the voltage falls to and below Vdet1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RN</name>
                            <description>Voltage Monitor Reset Negate Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Negation follows a stabilization time (tPVD) after VCC &gt; Vdet is detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Negation follows a stabilization time (tPVD) after assertion of the PVD reset.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VBATTMNSELR</name>
                    <description>Battery Backup Voltage Monitor Function Select Register</description>
                    <addressOffset>0xA84</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VBATTMNSEL</name>
                            <description>VBATT Voltage Monitor Function Select Bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
