ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>FBPROT0</name>
                    <description>Flash Block Protection</description>
                    <addressOffset>0x078</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BPCN0</name>
                            <description>Block Protection for non-secure CancelDisables block protect for non-secure function</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>User area is protected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>User area is not protected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key CodeThese bits enable or disable BPCN0 bit modification. The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x78</name>
                                    <description>Writing to the other bits in this register is enabled.</description>
                                    <value>0x78</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Writing to the other bits in this register is disabled.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FBPROT1</name>
                    <description>Flash Block Protection for secure Register</description>
                    <addressOffset>0x07C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BPCN1</name>
                            <description>Block Protection for secure CancelDisables block protection for secure</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>User area is protected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>User area is not protected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>Key CodeThese bits enable or disable BPCN1 bit modification. The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0xB1</name>
                                    <description>Writing to the other bits in this register is enabled.</description>
                                    <value>0xB1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Writing to the other bits in this register is disabled.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSTATR</name>
                    <description>Flash Status Register</description>
                    <addressOffset>0x080</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00008000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FHVEERR</name>
                            <description>"fhve" Error</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error has been detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An error has been detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PRGSPD</name>
                            <description>Programming-Suspended Status</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Flash sequencer is in status other than the below mentioned.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Flash sequencer is in programming suspension process or programming-suspended status.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ERSSPD</name>
                            <description>Erasure-Suspended Status</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Flash sequencer is in status other than the below mentioned.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Flash sequencer is in erasure suspension process or erasure-suspended status.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DBFULL</name>
                            <description>Data Buffer Full</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Buffer is not full</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SUSRDY</name>
                            <description>Suspend Ready</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Flash sequencer cannot accept "Program/Erase Suspend" command.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Flash sequencer can accept "Program/Erase Suspend" command.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PRGERR</name>
                            <description>Programming Error</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Programming has been completed successfully</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An error has occurred during programming</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ERSERR</name>
                            <description>Erasure Error</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Erasure processing has been completed successfully</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>An error has occurred during erasure</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ILGLERR</name>
                            <description>Illegal Command Error</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Flash sequencer has not detected any illegal command or illegal flash memory access.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Flash sequencer has detected an illegal command or illegal flash memory access</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FRDY</name>
                            <description>Flash Ready</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>"Program", "DMA Program", "Erase", "Program" or "Erase" command suspension, "Forced Stop", "Blank Check", "Config Program", "Config Clear", "Lock Bit Program", "Lock Bit Read", or "OTP Program" is processing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>None of the above is in progress.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000.</description>
                            <lsb>16</lsb>
                            <msb>18</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TZFERR</name>
                            <description>TrustZone Filter ErrorWhen this bit is "1", flash sequencer enters "Command Lock" state.</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OTERR</name>
                            <description>Other ErrorWhen this bit is "1", flash sequencer enters "Command Lock" state.</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SECERR</name>
                            <description>Security ErrorWhen this bit is "1", flash sequencer enters "Command Lock" state.</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FESETERR</name>
                            <description>FENTRY Setting ErrorWhen this bit is "1", flash sequencer enters "Command Lock" state.</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ILGCOMERR</name>
                            <description>Illegal Command ErrorWhen this bit is "1", flash sequencer enters "Command Lock" state.</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FENTRYR</name>
                    <description>Flash P/E Mode Entry Register</description>
                    <addressOffset>0x084</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FENTRYC</name>
                            <description>Code Flash P/E Mode EntryThese bits can be written when FRDY bit in FSTATR register is "1". Writing to this bit in FRDY = "0" is ignored.Writing to these bits is enabled only when this register is accessed in 16-bit size and H'AA is written to KEY bits</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Code flash is in "Read Mode"</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Code flash is in "P/E Mode"</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>1</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FENTRYD</name>
                            <description>Data Flash P/E Mode EntryThese bits can be written when FRDY bit in FSTATR register is "1". Writing to this bit in FRDY = "0" is ignored.Writing to these bits is enabled only when this register is accessed in 16-bit size and H'AA is written to KEY bits.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data flash is in "Read Mode"</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Data flash is in "P/E Mode"</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>KEY Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0xAA</name>
                                    <description>Writing to the other bits in this register is enabled.</description>
                                    <value>0xAA</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Writing to the other bits in this register is disabled.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
