ra-rs/ra/svd/vendor/R7FA8D1BH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>GLCDC</name>
            <description>Graphics LCD Controller</description>
            <baseAddress>0x40342000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4124</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1100</offset>
                <size>760</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1400</offset>
                <size>44</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1440</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR1_CLUT0[%s]</name>
                    <description>Color Palette 0 Plane for Graphics 1 Plane</description>
                    <addressOffset>0x0000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>B Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>A</name>
                            <description>Alpha Blending Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR1_CLUT1[%s]</name>
                    <description>Color Palette 1 Plane for Graphics 1 Plane</description>
                    <addressOffset>0x0400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>B Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>A</name>
                            <description>Alpha Blending Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR2_CLUT0[%s]</name>
                    <description>Color Palette 0 Plane for Graphics 2 Plane</description>
                    <addressOffset>0x0800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>B Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>A</name>
                            <description>Alpha Blending Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR2_CLUT1[%s]</name>
                    <description>Color Palette 1 Plane for Graphics 2 Plane</description>
                    <addressOffset>0x0C00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>B</name>
                            <description>B Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>A</name>
                            <description>Alpha Blending Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_EN</name>
                    <description>Background Plane Setting Operation Control Register</description>
                    <addressOffset>0x1000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>Background plane generation module operation enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables operation.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables operation.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VEN</name>
                            <description>Control of LCDC internal register value reflection to internal operations</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToSet</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables(Cleared to 0 by an internal source)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>9</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWRST</name>
                            <description>Entire module SW reset control</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Releases the entire module from the SW reset state.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Places the entire module in the SW reset state.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000. The write value should be 000000000000000.</description>
                            <lsb>17</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_PERI</name>
                    <description>Background Plane Setting Free-Running Period Register</description>
                    <addressOffset>0x1004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00170017</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FH</name>
                            <description>Background plane horizontal synchronization signal period on the basis of pixel clock (PXCLK).</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x017</minimum>
                                    <maximum>0x3FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FH</name>
                                    <description>FH lines. The valid range is 0x017 to 0x3FF. </description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>11</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FV</name>
                            <description>Background plane vertical synchronization signal period on the basis of line.</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x013</minimum>
                                    <maximum>0x3FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FV</name>
                                    <description>FV lines.The valid range is 0x013 to 0x3FF.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>27</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_SYNC</name>
                    <description>Background Plane Setting Synchronization Position Register</description>
                    <addressOffset>0x1008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HP</name>
                            <description>Background plane horizontal synchronization signal assertion position on the basis of pixel clock (PXCLK).</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>Setting prohibited</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>(HP)th line (pixels)</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000. The write value should be 000000000000.</description>
                            <lsb>4</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VP</name>
                            <description>Background plane vertical synchronization signal assertion position on the basis of line.</description>
                            <lsb>16</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0</name>
                                    <description>Setting prohibited</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>(VP)th line</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000. The write value should be 000000000000.</description>
                            <lsb>20</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
