ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_LUT5</name>
                    <description>Gamma %s Correction Block Table Setting Register 5</description>
                    <addressOffset>0x1318</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GAIN09</name>
                            <description>Gain value of area 9Unsigned 11-bit fixed point</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GAIN09</name>
                                    <description>GAIN09/1024</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>11</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN08</name>
                            <description>Gain value of area 8Unsigned 11-bit fixed point</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GAIN08</name>
                                    <description>GAIN08/1024</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>27</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_LUT6</name>
                    <description>Gamma %s Correction Block Table Setting Register 6</description>
                    <addressOffset>0x131C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GAIN11</name>
                            <description>Gain value of area 11Unsigned 11-bit fixed point</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GAIN11</name>
                                    <description>GAIN11/1024</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>11</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN10</name>
                            <description>Gain value of area 10Unsigned 11-bit fixed point</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GAIN10</name>
                                    <description>GAIN10/1024</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>27</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_LUT7</name>
                    <description>Gamma %s Correction Block Table Setting Register 7</description>
                    <addressOffset>0x1320</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GAIN13</name>
                            <description>Gain value of area 13Unsigned 11-bit fixed point</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GAIN13</name>
                                    <description>GAIN13/1024</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>11</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN12</name>
                            <description>Gain value of area 12Unsigned 11-bit fixed point</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GAIN12</name>
                                    <description>GAIN12/1024</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>27</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_LUT8</name>
                    <description>Gamma %s Correction Block Table Setting Register 8</description>
                    <addressOffset>0x1324</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GAIN15</name>
                            <description>Gain value of area 15Unsigned 11-bit fixed point</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GAIN15</name>
                                    <description>GAIN15/1024</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>11</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAIN14</name>
                            <description>Gain value of area 14Unsigned 11-bit fixed point</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GAIN14</name>
                                    <description>GAIN14/1024</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>27</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_AREA1</name>
                    <description>Gamma %s Correction Block Area Setting Register 1</description>
                    <addressOffset>0x1328</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TH03</name>
                            <description>Start threshold of area 3Unsigned 10-bit integer</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH02</name>
                            <description>Start threshold of area 2Unsigned 10-bit integer</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH01</name>
                            <description>Start threshold of area 1Unsigned 10-bit integer</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_AREA2</name>
                    <description>Gamma %s Correction Block Area Setting Register 2</description>
                    <addressOffset>0x132C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TH06</name>
                            <description>Start threshold of area 6Unsigned 10-bit integer</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH05</name>
                            <description>Start threshold of area 5Unsigned 10-bit integer</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH04</name>
                            <description>Start threshold of area 4Unsigned 10-bit integer</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_AREA3</name>
                    <description>Gamma %s Correction Block Area Setting Register 3</description>
                    <addressOffset>0x1330</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TH09</name>
                            <description>Start threshold of area 9Unsigned 10-bit integer</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH08</name>
                            <description>Start threshold of area 8Unsigned 10-bit integer</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH07</name>
                            <description>Start threshold of area 7Unsigned 10-bit integer</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_AREA4</name>
                    <description>Gamma %s Correction Block Area Setting Register 4</description>
                    <addressOffset>0x1334</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TH12</name>
                            <description>Start threshold of area 12Unsigned 10-bit integer</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH11</name>
                            <description>Start threshold of area 11Unsigned 10-bit integer</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH10</name>
                            <description>Start threshold of area 10Unsigned 10-bit integer</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_AREA5</name>
                    <description>Gamma %s Correction Block Area Setting Register 5</description>
                    <addressOffset>0x1338</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TH15</name>
                            <description>Start threshold of area 15Unsigned 10-bit integer</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH14</name>
                            <description>Start threshold of area 14Unsigned 10-bit integer</description>
                            <lsb>10</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TH13</name>
                            <description>Start threshold of area 13Unsigned 10-bit integer</description>
                            <lsb>20</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
