ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>PERFTRIGGER</name>
                    <description>Performance Counters Control Register</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PERFTRIGGER1</name>
                            <description>Selects the internal event that will increment PERFCOUNT1 register.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>disable performance counter </description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x01</name>
                                    <description>2D Drawing Engine active cycles </description>
                                    <value>0x01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02</name>
                                    <description>framebuffer read access </description>
                                    <value>0x02</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x03</name>
                                    <description>framebuffer write access </description>
                                    <value>0x03</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x04</name>
                                    <description>texture read access </description>
                                    <value>0x04</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x05</name>
                                    <description>invisible pixels (enumerated but selected with alpha 0percent) </description>
                                    <value>0x05</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x06</name>
                                    <description>invisible pixels while internal FIFO is empty (lost cycles) </description>
                                    <value>0x06</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x07</name>
                                    <description>display list reader active cycles </description>
                                    <value>0x07</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x08</name>
                                    <description>framebuffer read hits</description>
                                    <value>0x08</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x09</name>
                                    <description>framebuffer read misses</description>
                                    <value>0x09</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0A</name>
                                    <description>framebuffer write hits </description>
                                    <value>0x0A</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0B</name>
                                    <description>framebuffer write misses </description>
                                    <value>0x0B</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0C</name>
                                    <description>texture read hits </description>
                                    <value>0x0C</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0D</name>
                                    <description>texture read misses </description>
                                    <value>0x0D</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>every clock cycle (for use as timer) </description>
                                    <value>0x1F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PERFTRIGGER2</name>
                            <description>Selects the internal event that will increment PERFCOUNT2 register</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>disable performance counter </description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x01</name>
                                    <description>2D Drawing Engine active cycles </description>
                                    <value>0x01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02</name>
                                    <description>framebuffer read access </description>
                                    <value>0x02</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x03</name>
                                    <description>framebuffer write access </description>
                                    <value>0x03</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x04</name>
                                    <description>texture read access </description>
                                    <value>0x04</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x05</name>
                                    <description>invisible pixels (enumerated but selected with alpha 0percent) </description>
                                    <value>0x05</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x06</name>
                                    <description>invisible pixels while internal FIFO is empty (lost cycles) </description>
                                    <value>0x06</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x07</name>
                                    <description>display list reader active cycles </description>
                                    <value>0x07</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x08</name>
                                    <description>framebuffer read hits</description>
                                    <value>0x08</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x09</name>
                                    <description>framebuffer read misses</description>
                                    <value>0x09</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0A</name>
                                    <description>framebuffer write hits </description>
                                    <value>0x0A</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0B</name>
                                    <description>framebuffer write misses </description>
                                    <value>0x0B</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0C</name>
                                    <description>texture read hits </description>
                                    <value>0x0C</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0D</name>
                                    <description>texture read misses </description>
                                    <value>0x0D</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>every clock cycle (for use as timer) </description>
                                    <value>0x1F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXCLADDR</name>
                    <description>CLUT Start Address Register</description>
                    <addressOffset>0xDC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLADDR</name>
                            <description>Texture CLUT start address for indexed texture format</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXCLDATA</name>
                    <description>CLUT Data Register</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLDATA</name>
                            <description>Texture CLUT data for Indexed texture format</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXCLOFFSET</name>
                    <description>CLUT Offset Register</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLOFFSET</name>
                            <description>Texture CLUT offset for Indexed texture format. CLOFFSET[7:0] is or'ed with the original index</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COLKEY</name>
                    <description>Color Key Register</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>COLKEYB</name>
                            <description>Blue channel of color key</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLKEYG</name>
                            <description>Green channel of color key</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLKEYR</name>
                            <description>Red channel of color key</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
