ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>TXPPD0R_H</name>
                    <description>Transmit Packet Payload Data 0 Register</description>
                    <alternateRegister>TXPPD0R</alternateRegister>
                    <addressOffset>0x162</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA2</name>
                            <description>Payload Data 2</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA3</name>
                            <description>Payload Data 3</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD0R_HL</name>
                    <description>Transmit Packet Payload Data 0 Register</description>
                    <alternateRegister>TXPPD0R</alternateRegister>
                    <addressOffset>0x162</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA2</name>
                            <description>Payload Data 2</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD0R_HH</name>
                    <description>Transmit Packet Payload Data 0 Register</description>
                    <alternateRegister>TXPPD0R</alternateRegister>
                    <addressOffset>0x163</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>Payload Data 3</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD1R</name>
                    <description>Transmit Packet Payload Data 1 Register</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA4</name>
                            <description>Payload Data 4</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA5</name>
                            <description>Payload Data 5</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA6</name>
                            <description>Payload Data 6</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA7</name>
                            <description>Payload Data 7</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD1R_L</name>
                    <description>Transmit Packet Payload Data 1 Register</description>
                    <alternateRegister>TXPPD1R</alternateRegister>
                    <addressOffset>0x164</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA4</name>
                            <description>Payload Data 4</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA5</name>
                            <description>Payload Data 5</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD1R_LL</name>
                    <description>Transmit Packet Payload Data 1 Register</description>
                    <alternateRegister>TXPPD1R</alternateRegister>
                    <addressOffset>0x164</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA4</name>
                            <description>Payload Data 4</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD1R_LH</name>
                    <description>Transmit Packet Payload Data 1 Register</description>
                    <alternateRegister>TXPPD1R</alternateRegister>
                    <addressOffset>0x165</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA5</name>
                            <description>Payload Data 5</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD1R_H</name>
                    <description>Transmit Packet Payload Data 1 Register</description>
                    <alternateRegister>TXPPD1R</alternateRegister>
                    <addressOffset>0x166</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA6</name>
                            <description>Payload Data 6</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA7</name>
                            <description>Payload Data 7</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD1R_HL</name>
                    <description>Transmit Packet Payload Data 1 Register</description>
                    <alternateRegister>TXPPD1R</alternateRegister>
                    <addressOffset>0x166</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA6</name>
                            <description>Payload Data 6</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD1R_HH</name>
                    <description>Transmit Packet Payload Data 1 Register</description>
                    <alternateRegister>TXPPD1R</alternateRegister>
                    <addressOffset>0x167</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA7</name>
                            <description>Payload Data 7</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD2R</name>
                    <description>Transmit Packet Payload Data 2 Register</description>
                    <addressOffset>0x168</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA8</name>
                            <description>Payload Data 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA9</name>
                            <description>Payload Data 9</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA10</name>
                            <description>Payload Data 10</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA11</name>
                            <description>Payload Data 11</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD2R_L</name>
                    <description>Transmit Packet Payload Data 2 Register</description>
                    <alternateRegister>TXPPD2R</alternateRegister>
                    <addressOffset>0x168</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA8</name>
                            <description>Payload Data 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA9</name>
                            <description>Payload Data 9</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD2R_LL</name>
                    <description>Transmit Packet Payload Data 2 Register</description>
                    <alternateRegister>TXPPD2R</alternateRegister>
                    <addressOffset>0x168</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA8</name>
                            <description>Payload Data 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD2R_LH</name>
                    <description>Transmit Packet Payload Data 2 Register</description>
                    <alternateRegister>TXPPD2R</alternateRegister>
                    <addressOffset>0x169</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA9</name>
                            <description>Payload Data 9</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD2R_H</name>
                    <description>Transmit Packet Payload Data 2 Register</description>
                    <alternateRegister>TXPPD2R</alternateRegister>
                    <addressOffset>0x16A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA10</name>
                            <description>Payload Data 10</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA11</name>
                            <description>Payload Data 11</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD2R_HL</name>
                    <description>Transmit Packet Payload Data 2 Register</description>
                    <alternateRegister>TXPPD2R</alternateRegister>
                    <addressOffset>0x16A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA10</name>
                            <description>Payload Data 10</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD2R_HH</name>
                    <description>Transmit Packet Payload Data 2 Register</description>
                    <alternateRegister>TXPPD2R</alternateRegister>
                    <addressOffset>0x16B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA11</name>
                            <description>Payload Data 11</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD3R</name>
                    <description>Transmit Packet Payload Data 3 Register</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA12</name>
                            <description>Payload Data 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA13</name>
                            <description>Payload Data 13</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA14</name>
                            <description>Payload Data 14</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA15</name>
                            <description>Payload Data 15</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD3R_L</name>
                    <description>Transmit Packet Payload Data 3 Register</description>
                    <alternateRegister>TXPPD3R</alternateRegister>
                    <addressOffset>0x16C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA12</name>
                            <description>Payload Data 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATA13</name>
                            <description>Payload Data 13</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD3R_LL</name>
                    <description>Transmit Packet Payload Data 3 Register</description>
                    <alternateRegister>TXPPD3R</alternateRegister>
                    <addressOffset>0x16C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA12</name>
                            <description>Payload Data 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPPD3R_LH</name>
                    <description>Transmit Packet Payload Data 3 Register</description>
                    <alternateRegister>TXPPD3R</alternateRegister>
                    <addressOffset>0x16D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA13</name>
                            <description>Payload Data 13</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
