ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>RXPPD2R</name>
                    <description>Receive Packet Payload Data 2 Register</description>
                    <addressOffset>0x2C8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA8</name>
                            <description>Payload Data 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA9</name>
                            <description>Payload Data 9</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA10</name>
                            <description>Payload Data 10</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA11</name>
                            <description>Payload Data 11</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD2R_L</name>
                    <description>Receive Packet Payload Data 2 Register</description>
                    <alternateRegister>RXPPD2R</alternateRegister>
                    <addressOffset>0x2C8</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA8</name>
                            <description>Payload Data 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA9</name>
                            <description>Payload Data 9</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD2R_LL</name>
                    <description>Receive Packet Payload Data 2 Register</description>
                    <alternateRegister>RXPPD2R</alternateRegister>
                    <addressOffset>0x2C8</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA8</name>
                            <description>Payload Data 8</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD2R_LH</name>
                    <description>Receive Packet Payload Data 2 Register</description>
                    <alternateRegister>RXPPD2R</alternateRegister>
                    <addressOffset>0x2C9</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA9</name>
                            <description>Payload Data 9</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD2R_H</name>
                    <description>Receive Packet Payload Data 2 Register</description>
                    <alternateRegister>RXPPD2R</alternateRegister>
                    <addressOffset>0x2CA</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA10</name>
                            <description>Payload Data 10</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA11</name>
                            <description>Payload Data 11</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD2R_HL</name>
                    <description>Receive Packet Payload Data 2 Register</description>
                    <alternateRegister>RXPPD2R</alternateRegister>
                    <addressOffset>0x2CA</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA10</name>
                            <description>Payload Data 10</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD2R_HH</name>
                    <description>Receive Packet Payload Data 2 Register</description>
                    <alternateRegister>RXPPD2R</alternateRegister>
                    <addressOffset>0x2CB</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA11</name>
                            <description>Payload Data 11</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD3R</name>
                    <description>Receive Packet Payload Data 3 Register</description>
                    <addressOffset>0x2CC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA12</name>
                            <description>Payload Data 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA13</name>
                            <description>Payload Data 13</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA14</name>
                            <description>Payload Data 14</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA15</name>
                            <description>Payload Data 15</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD3R_L</name>
                    <description>Receive Packet Payload Data 3 Register</description>
                    <alternateRegister>RXPPD3R</alternateRegister>
                    <addressOffset>0x2CC</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA12</name>
                            <description>Payload Data 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA13</name>
                            <description>Payload Data 13</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD3R_LL</name>
                    <description>Receive Packet Payload Data 3 Register</description>
                    <alternateRegister>RXPPD3R</alternateRegister>
                    <addressOffset>0x2CC</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA12</name>
                            <description>Payload Data 12</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD3R_LH</name>
                    <description>Receive Packet Payload Data 3 Register</description>
                    <alternateRegister>RXPPD3R</alternateRegister>
                    <addressOffset>0x2CD</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA13</name>
                            <description>Payload Data 13</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD3R_H</name>
                    <description>Receive Packet Payload Data 3 Register</description>
                    <alternateRegister>RXPPD3R</alternateRegister>
                    <addressOffset>0x2CE</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA14</name>
                            <description>Payload Data 14</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATA15</name>
                            <description>Payload Data 15</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD3R_HL</name>
                    <description>Receive Packet Payload Data 3 Register</description>
                    <alternateRegister>RXPPD3R</alternateRegister>
                    <addressOffset>0x2CE</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA14</name>
                            <description>Payload Data 14</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPPD3R_HH</name>
                    <description>Receive Packet Payload Data 3 Register</description>
                    <alternateRegister>RXPPD3R</alternateRegister>
                    <addressOffset>0x2CF</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DATA15</name>
                            <description>Payload Data 15</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSTXTOSETR</name>
                    <description>HS TX Timeout Set Register</description>
                    <addressOffset>0x2E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HTXTO</name>
                            <description>HS TX Timeout Count</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LRXHTOSETR</name>
                    <description>LRX-H Timeout Set Register</description>
                    <addressOffset>0x2E4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LRXHTO</name>
                            <description>LP-RX Host Processor Timeout</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TATOSETR</name>
                    <description>TA Timeout Set Register</description>
                    <addressOffset>0x2E8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TATO</name>
                            <description>Turnaround Acknowledge Timeout</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
