ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>VMPPSETR_LH</name>
                    <description>Video Mode Pixel Packet Set Register</description>
                    <alternateRegister>VMPPSETR</alternateRegister>
                    <addressOffset>0x421</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXESYNC</name>
                            <description>Transmit End of Sync Pulse</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>HSE and VSE are not transmitted</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>HSE and VSE are transmitted</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMPPSETR_H</name>
                    <description>Video Mode Pixel Packet Set Register</description>
                    <alternateRegister>VMPPSETR</alternateRegister>
                    <addressOffset>0x422</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x000E</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DT</name>
                            <description>Video Mode Data Type</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>001110</name>
                                    <description>Packed Pixel Stream, 16 bit RGB</description>
                                    <value>#001110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011110</name>
                                    <description>Packed Pixel Stream, 18 bit RGB</description>
                                    <value>#011110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111110</name>
                                    <description>Packed Pixel Stream, 24 bit RGB</description>
                                    <value>#111110</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VC</name>
                            <description>Video Mode Virtual Channel</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMPPSETR_HL</name>
                    <description>Video Mode Pixel Packet Set Register</description>
                    <alternateRegister>VMPPSETR</alternateRegister>
                    <addressOffset>0x422</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0E</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DT</name>
                            <description>Video Mode Data Type</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>001110</name>
                                    <description>Packed Pixel Stream, 16 bit RGB</description>
                                    <value>#001110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011110</name>
                                    <description>Packed Pixel Stream, 18 bit RGB</description>
                                    <value>#011110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111110</name>
                                    <description>Packed Pixel Stream, 24 bit RGB</description>
                                    <value>#111110</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VC</name>
                            <description>Video Mode Virtual Channel</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVSSETR</name>
                    <description>Video Mode Vertical Size Set Register</description>
                    <addressOffset>0x428</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VSA</name>
                            <description>VSA Lines</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>12</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VSPOL</name>
                            <description>VSYNC Polarity</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>High Active</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Low Active</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VACT</name>
                            <description>Vertical Active Lines</description>
                            <lsb>16</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVSSETR_L</name>
                    <description>Video Mode Vertical Size Set Register</description>
                    <alternateRegister>VMVSSETR</alternateRegister>
                    <addressOffset>0x428</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VSA</name>
                            <description>VSA Lines</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>12</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VSPOL</name>
                            <description>VSYNC Polarity</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>High Active</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Low Active</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVSSETR_LL</name>
                    <description>Video Mode Vertical Size Set Register</description>
                    <alternateRegister>VMVSSETR</alternateRegister>
                    <addressOffset>0x428</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VSA</name>
                            <description>VSA Lines</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVSSETR_LH</name>
                    <description>Video Mode Vertical Size Set Register</description>
                    <alternateRegister>VMVSSETR</alternateRegister>
                    <addressOffset>0x429</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VSA</name>
                            <description>VSA Lines</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VSPOL</name>
                            <description>VSYNC Polarity</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>High Active</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Low Active</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVSSETR_H</name>
                    <description>Video Mode Vertical Size Set Register</description>
                    <alternateRegister>VMVSSETR</alternateRegister>
                    <addressOffset>0x42A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VACT</name>
                            <description>Vertical Active Lines</description>
                            <lsb>0</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVSSETR_HL</name>
                    <description>Video Mode Vertical Size Set Register</description>
                    <alternateRegister>VMVSSETR</alternateRegister>
                    <addressOffset>0x42A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VACT</name>
                            <description>Vertical Active Lines</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVSSETR_HH</name>
                    <description>Video Mode Vertical Size Set Register</description>
                    <alternateRegister>VMVSSETR</alternateRegister>
                    <addressOffset>0x42B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VACT</name>
                            <description>Vertical Active Lines</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVPSETR</name>
                    <description>Video Mode Vertical Porch Set Register</description>
                    <addressOffset>0x42C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VBP</name>
                            <description>VBP Lines</description>
                            <lsb>0</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>13</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VFP</name>
                            <description>VFP Lines</description>
                            <lsb>16</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>29</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVPSETR_L</name>
                    <description>Video Mode Vertical Porch Set Register</description>
                    <alternateRegister>VMVPSETR</alternateRegister>
                    <addressOffset>0x42C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VBP</name>
                            <description>VBP Lines</description>
                            <lsb>0</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>13</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVPSETR_LL</name>
                    <description>Video Mode Vertical Porch Set Register</description>
                    <alternateRegister>VMVPSETR</alternateRegister>
                    <addressOffset>0x42C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VBP</name>
                            <description>VBP Lines</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VMVPSETR_LH</name>
                    <description>Video Mode Vertical Porch Set Register</description>
                    <alternateRegister>VMVPSETR</alternateRegister>
                    <addressOffset>0x42D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VBP</name>
                            <description>VBP Lines</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
