ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>SQCH1SR</name>
                    <description>Sequence Channel 1 Status Register</description>
                    <addressOffset>0x610</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RUNNING</name>
                            <description>Sequence Operation Running Status</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Sequence operation is stopped</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Sequence operation is running</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AACTFIN</name>
                            <description>All Actions Finish Interrupt Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>All actions of a descriptor have not finished</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>All actions of a descriptor finished operations</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADESFIN</name>
                            <description>All-Descriptors Finish Interrupt Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>All descriptors have not finished</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>All descriptors finished operations</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000.</description>
                            <lsb>9</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DABORT</name>
                            <description>Descriptor Abort Interrupt Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No aborted descriptor </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A descriptor execution was aborted</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00.</description>
                            <lsb>17</lsb>
                            <msb>18</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SIZEERR</name>
                            <description>Packet Size Error Interrupt Flag</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Sequence packet size is too large</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00.</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TXIBERR</name>
                            <description>Tx Internal Bus Error Interrupt Flag</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Internal AXI bus read error occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RXFERR</name>
                            <description>Receive Fatal Error Interrupt Flag</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Fatal timeout occurred during BTA</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXFAIL</name>
                            <description>Receive Fail Interrupt Flag</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Expected receive did not take place</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXPFAIL</name>
                            <description>Receive Packet Data Fail Interrupt Flag</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Received packet data is not stored correctly</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXCORERR</name>
                            <description>Receive Correctable Error Interrupt Flag</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Received packets have correctable error</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXAKE</name>
                            <description>Receive Acknowledge and Error Report Packet Interrupt Flag</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No error</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Acknowledge and Error Report Packet is received</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQCH1SR_L</name>
                    <description>Sequence Channel 1 Status Register</description>
                    <alternateRegister>SQCH1SR</alternateRegister>
                    <addressOffset>0x610</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RUNNING</name>
                            <description>Sequence Operation Running Status</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Sequence operation is stopped</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Sequence operation is running</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>AACTFIN</name>
                            <description>All Actions Finish Interrupt Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>All actions of a descriptor have not finished</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>All actions of a descriptor finished operations</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADESFIN</name>
                            <description>All-Descriptors Finish Interrupt Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>All descriptors have not finished</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>All descriptors finished operations</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000.</description>
                            <lsb>9</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
