ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sCR</name>
                    <description>Sequence Channel 1 Descriptor-%s C Register</description>
                    <addressOffset>0x808</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>FINACT</name>
                            <description>Finish Action</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000000. The write value should be 0000000000000000000.</description>
                            <lsb>3</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXOP</name>
                            <description>Auxiliary Operation</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not use auxiliary operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Execute auxiliary operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACTCODE</name>
                            <description>Action Code</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000000</name>
                                    <description>Slot-0 (RXRSS0R)</description>
                                    <value>#00000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000001</name>
                                    <description>Slot-1 (RXRSS1R)</description>
                                    <value>#00000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000010</name>
                                    <description>Slot-2 (RXRSS2R)</description>
                                    <value>#00000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000011</name>
                                    <description>Slot-3 (RXRSS3R)</description>
                                    <value>#00000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000000</name>
                                    <description>Send Reset-Trigger </description>
                                    <value>#00000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000100</name>
                                    <description>Send Initial Skew calibration</description>
                                    <value>#00000100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000101</name>
                                    <description>Send Periodic Skew calibration</description>
                                    <value>#00000101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001000</name>
                                    <description>No-operation </description>
                                    <value>#00001000</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sCR_L</name>
                    <description>Sequence Channel 1 Descriptor-%s C Register</description>
                    <alternateRegister>SQCH1DSC%sCR</alternateRegister>
                    <addressOffset>0x808</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FINACT</name>
                            <description>Finish Action</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000. The write value should be 0000000000000.</description>
                            <lsb>3</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sCR_LL</name>
                    <description>Sequence Channel 1 Descriptor-%s C Register</description>
                    <alternateRegister>SQCH1DSC%sCR</alternateRegister>
                    <addressOffset>0x808</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FINACT</name>
                            <description>Finish Action</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sCR_H</name>
                    <description>Sequence Channel 1 Descriptor-%s C Register</description>
                    <alternateRegister>SQCH1DSC%sCR</alternateRegister>
                    <addressOffset>0x80A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXOP</name>
                            <description>Auxiliary Operation</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not use auxiliary operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Execute auxiliary operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACTCODE</name>
                            <description>Action Code</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000000</name>
                                    <description>Slot-0 (RXRSS0R)</description>
                                    <value>#00000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000001</name>
                                    <description>Slot-1 (RXRSS1R)</description>
                                    <value>#00000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000010</name>
                                    <description>Slot-2 (RXRSS2R)</description>
                                    <value>#00000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000011</name>
                                    <description>Slot-3 (RXRSS3R)</description>
                                    <value>#00000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000000</name>
                                    <description>Send Reset-Trigger </description>
                                    <value>#00000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000100</name>
                                    <description>Send Initial Skew calibration</description>
                                    <value>#00000100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000101</name>
                                    <description>Send Periodic Skew calibration</description>
                                    <value>#00000101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001000</name>
                                    <description>No-operation </description>
                                    <value>#00001000</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sCR_HL</name>
                    <description>Sequence Channel 1 Descriptor-%s C Register</description>
                    <alternateRegister>SQCH1DSC%sCR</alternateRegister>
                    <addressOffset>0x80A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AUXOP</name>
                            <description>Auxiliary Operation</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not use auxiliary operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Execute auxiliary operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sCR_HH</name>
                    <description>Sequence Channel 1 Descriptor-%s C Register</description>
                    <alternateRegister>SQCH1DSC%sCR</alternateRegister>
                    <addressOffset>0x80B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ACTCODE</name>
                            <description>Action Code</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000000</name>
                                    <description>Slot-0 (RXRSS0R)</description>
                                    <value>#00000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000001</name>
                                    <description>Slot-1 (RXRSS1R)</description>
                                    <value>#00000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000010</name>
                                    <description>Slot-2 (RXRSS2R)</description>
                                    <value>#00000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000011</name>
                                    <description>Slot-3 (RXRSS3R)</description>
                                    <value>#00000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000000</name>
                                    <description>Send Reset-Trigger </description>
                                    <value>#00000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000100</name>
                                    <description>Send Initial Skew calibration</description>
                                    <value>#00000100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000101</name>
                                    <description>Send Periodic Skew calibration</description>
                                    <value>#00000101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001000</name>
                                    <description>No-operation </description>
                                    <value>#00001000</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
