ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sDR</name>
                    <description>Sequence Channel 1 Descriptor-%s D Register</description>
                    <addressOffset>0x80C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sDR_L</name>
                    <description>Sequence Channel 1 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH1DSC%sDR</alternateRegister>
                    <addressOffset>0x80C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sDR_LL</name>
                    <description>Sequence Channel 1 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH1DSC%sDR</alternateRegister>
                    <addressOffset>0x80C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sDR_LH</name>
                    <description>Sequence Channel 1 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH1DSC%sDR</alternateRegister>
                    <addressOffset>0x80D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSCmDR_H</name>
                    <description>Sequence Channel 1 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH1DSC%sDR</alternateRegister>
                    <addressOffset>0x80E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sDR_HL</name>
                    <description>Sequence Channel 1 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH1DSC%sDR</alternateRegister>
                    <addressOffset>0x80E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x010</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>SQCH1DSC%sDR_HH</name>
                    <description>Sequence Channel 1 Descriptor-%s D Register</description>
                    <alternateRegister>SQCH1DSC%sDR</alternateRegister>
                    <addressOffset>0x80F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Lower Address</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
