ra-rs/ra/svd/vendor/R7FA8D1BH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DPHYCNT</name>
            <description>D-PHY Controller Top</description>
            <baseAddress>0x40346C00</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>60</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x114</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x130</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x140</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DPHYREFCR</name>
                    <description>D-PHY Reference Clock Setting Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000002F</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RFREQ</name>
                            <description>Reference Clock Frequency Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00100111</name>
                                    <description>40MHz</description>
                                    <value>#00100111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101000</name>
                                    <description>41MHz</description>
                                    <value>#00101000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101001</name>
                                    <description>42MHz</description>
                                    <value>#00101001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110101</name>
                                    <description>118MHz</description>
                                    <value>#01110101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110110</name>
                                    <description>119MHz</description>
                                    <value>#01110110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110111</name>
                                    <description>120MHz</description>
                                    <value>#01110111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000000. The write value should be 000000000000000000000000.</description>
                            <lsb>8</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYREFCR_L</name>
                    <description>D-PHY Reference Clock Setting Register</description>
                    <alternateRegister>DPHYREFCR</alternateRegister>
                    <addressOffset>0x000</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x002F</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RFREQ</name>
                            <description>Reference Clock Frequency Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00100111</name>
                                    <description>40MHz</description>
                                    <value>#00100111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101000</name>
                                    <description>41MHz</description>
                                    <value>#00101000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101001</name>
                                    <description>42MHz</description>
                                    <value>#00101001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110101</name>
                                    <description>118MHz</description>
                                    <value>#01110101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110110</name>
                                    <description>119MHz</description>
                                    <value>#01110110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110111</name>
                                    <description>120MHz</description>
                                    <value>#01110111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYREFCR_LL</name>
                    <description>D-PHY Reference Clock Setting Register</description>
                    <alternateRegister>DPHYREFCR</alternateRegister>
                    <addressOffset>0x000</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x2F</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RFREQ</name>
                            <description>Reference Clock Frequency Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00100111</name>
                                    <description>40MHz</description>
                                    <value>#00100111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101000</name>
                                    <description>41MHz</description>
                                    <value>#00101000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101001</name>
                                    <description>42MHz</description>
                                    <value>#00101001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110101</name>
                                    <description>118MHz</description>
                                    <value>#01110101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110110</name>
                                    <description>119MHz</description>
                                    <value>#01110110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110111</name>
                                    <description>120MHz</description>
                                    <value>#01110111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYPLFCR</name>
                    <description>D-PHY PLL Frequency Control Register</description>
                    <addressOffset>0x004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00130000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IDIV</name>
                            <description>D-PHY PLL Input Frequency Division Ratio Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>1/2</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>1/3</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>1/4</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFMUL</name>
                            <description>D-PHY PLL Frequency Multiplication Factor Select (Fractional Part)</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>0.00 </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>0.33 </description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>0.66 </description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>0.50</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NMUL</name>
                            <description>D-PHY PLL Frequency Multiplication Factor Select (Integer Part)</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00010011</name>
                                    <description>20</description>
                                    <value>#00010011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00010100</name>
                                    <description>21</description>
                                    <value>#00010100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00010101</name>
                                    <description>22</description>
                                    <value>#00010101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01100010</name>
                                    <description>99</description>
                                    <value>#01100010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01100011</name>
                                    <description>100</description>
                                    <value>#01100011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01100100</name>
                                    <description>101</description>
                                    <value>#01100100</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYPLFCR_L</name>
                    <description>D-PHY PLL Frequency Control Register</description>
                    <alternateRegister>DPHYPLFCR</alternateRegister>
                    <addressOffset>0x004</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IDIV</name>
                            <description>D-PHY PLL Input Frequency Division Ratio Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>1/2</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>1/3</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>1/4</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFMUL</name>
                            <description>D-PHY PLL Frequency Multiplication Factor Select (Fractional Part)</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>0.00 </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>0.33 </description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>0.66 </description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>0.50</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
