ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>DPHYOCR_LL</name>
                    <description>D-PHY Operation Control Register</description>
                    <alternateRegister>DPHYOCR</alternateRegister>
                    <addressOffset>0x020</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DPHYEN</name>
                            <description>D-PHY Operation Control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable D-PHY operation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable D-PHY operation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM1</name>
                    <description>D-PHY Timing Control Register 1</description>
                    <addressOffset>0x024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00011941</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TINIT</name>
                            <description>D-PHY T_INIT Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000. The write value should be 0000000000000.</description>
                            <lsb>19</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM1_L</name>
                    <description>D-PHY Timing Control Register 1</description>
                    <alternateRegister>DPHYTIM1</alternateRegister>
                    <addressOffset>0x024</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x1941</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TINIT</name>
                            <description>D-PHY T_INIT Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM1_LL</name>
                    <description>D-PHY Timing Control Register 1</description>
                    <alternateRegister>DPHYTIM1</alternateRegister>
                    <addressOffset>0x024</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x41</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TINIT</name>
                            <description>D-PHY T_INIT Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM1_LH</name>
                    <description>D-PHY Timing Control Register 1</description>
                    <alternateRegister>DPHYTIM1</alternateRegister>
                    <addressOffset>0x025</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x19</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TINIT</name>
                            <description>D-PHY T_INIT Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM1_H</name>
                    <description>D-PHY Timing Control Register 1</description>
                    <alternateRegister>DPHYTIM1</alternateRegister>
                    <addressOffset>0x026</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0001</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TINIT</name>
                            <description>D-PHY T_INIT Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000. The write value should be 0000000000000.</description>
                            <lsb>3</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM1_HL</name>
                    <description>D-PHY Timing Control Register 1</description>
                    <alternateRegister>DPHYTIM1</alternateRegister>
                    <addressOffset>0x026</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TINIT</name>
                            <description>D-PHY T_INIT Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM2_LL</name>
                    <description>D-PHY Timing Control Register 2</description>
                    <alternateRegister>DPHYTIM2</alternateRegister>
                    <addressOffset>0x028</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x08</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TCLKPREP</name>
                            <description>D-PHY T_CLK_PREPARE Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM2_LH</name>
                    <description>D-PHY Timing Control Register 2</description>
                    <alternateRegister>DPHYTIM2</alternateRegister>
                    <addressOffset>0x029</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00010000. The write value should be 00010000.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM2_HL</name>
                    <description>D-PHY Timing Control Register 2</description>
                    <alternateRegister>DPHYTIM2</alternateRegister>
                    <addressOffset>0x02A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x02</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000010. The write value should be 00000010.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM3_LL</name>
                    <description>D-PHY Timing Control Register 3</description>
                    <alternateRegister>DPHYTIM3</alternateRegister>
                    <addressOffset>0x02C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x08</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>THSPREP</name>
                            <description>D-PHY T_THS_PREPARE Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM3_LH</name>
                    <description>D-PHY Timing Control Register 3</description>
                    <alternateRegister>DPHYTIM3</alternateRegister>
                    <addressOffset>0x02D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00010000. The write value should be 00010000.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM4</name>
                    <description>D-PHY Timing Control Register 4</description>
                    <addressOffset>0x030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0620031F</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TCLKZERO</name>
                            <description>D-PHY T_CLK_ZERO Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCLKPRE</name>
                            <description>D-PHY T_TCLK_PRE Parameter Setting</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCLKPOST</name>
                            <description>D-PHY T_TCLK_POST Parameter Setting</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCLKTRL</name>
                            <description>D-PHY T_TCLK_TRAIL Parameter Setting</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM4_L</name>
                    <description>D-PHY Timing Control Register 4</description>
                    <alternateRegister>DPHYTIM4</alternateRegister>
                    <addressOffset>0x030</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x031F</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TCLKZERO</name>
                            <description>D-PHY T_CLK_ZERO Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCLKPRE</name>
                            <description>D-PHY T_TCLK_PRE Parameter Setting</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM4_LL</name>
                    <description>D-PHY Timing Control Register 4</description>
                    <alternateRegister>DPHYTIM4</alternateRegister>
                    <addressOffset>0x030</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1F</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TCLKZERO</name>
                            <description>D-PHY T_CLK_ZERO Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM4_LH</name>
                    <description>D-PHY Timing Control Register 4</description>
                    <alternateRegister>DPHYTIM4</alternateRegister>
                    <addressOffset>0x031</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TCLKPRE</name>
                            <description>D-PHY T_TCLK_PRE Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM4_H</name>
                    <description>D-PHY Timing Control Register 4</description>
                    <alternateRegister>DPHYTIM4</alternateRegister>
                    <addressOffset>0x032</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0620</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TCLKPOST</name>
                            <description>D-PHY T_TCLK_POST Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCLKTRL</name>
                            <description>D-PHY T_TCLK_TRAIL Parameter Setting</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM4_HL</name>
                    <description>D-PHY Timing Control Register 4</description>
                    <alternateRegister>DPHYTIM4</alternateRegister>
                    <addressOffset>0x032</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x20</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TCLKPOST</name>
                            <description>D-PHY T_TCLK_POST Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM4_HH</name>
                    <description>D-PHY Timing Control Register 4</description>
                    <alternateRegister>DPHYTIM4</alternateRegister>
                    <addressOffset>0x033</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x06</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TCLKTRL</name>
                            <description>D-PHY T_TCLK_TRAIL Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM5</name>
                    <description>D-PHY Timing Control Register 5</description>
                    <addressOffset>0x034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000C080F</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>THSZERO</name>
                            <description>D-PHY T_THS_ZERO Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THSTRL</name>
                            <description>D-PHY T_THS_TRAIL Parameter Setting</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THSEXIT</name>
                            <description>D-PHY T_THS_EXIT Parameter Setting</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM5_L</name>
                    <description>D-PHY Timing Control Register 5</description>
                    <alternateRegister>DPHYTIM5</alternateRegister>
                    <addressOffset>0x034</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x080F</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>THSZERO</name>
                            <description>D-PHY T_THS_ZERO Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THSTRL</name>
                            <description>D-PHY T_THS_TRAIL Parameter Setting</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
