ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>DPHYTIM5_LL</name>
                    <description>D-PHY Timing Control Register 5</description>
                    <alternateRegister>DPHYTIM5</alternateRegister>
                    <addressOffset>0x034</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0F</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>THSZERO</name>
                            <description>D-PHY T_THS_ZERO Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM5_LH</name>
                    <description>D-PHY Timing Control Register 5</description>
                    <alternateRegister>DPHYTIM5</alternateRegister>
                    <addressOffset>0x035</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x08</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>THSTRL</name>
                            <description>D-PHY T_THS_TRAIL Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM5_H</name>
                    <description>D-PHY Timing Control Register 5</description>
                    <alternateRegister>DPHYTIM5</alternateRegister>
                    <addressOffset>0x036</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x000C</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>THSEXIT</name>
                            <description>D-PHY T_THS_EXIT Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM5_HL</name>
                    <description>D-PHY Timing Control Register 5</description>
                    <alternateRegister>DPHYTIM5</alternateRegister>
                    <addressOffset>0x036</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0C</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>THSEXIT</name>
                            <description>D-PHY T_THS_EXIT Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM6</name>
                    <description>D-PHY Timing Control Register 6</description>
                    <addressOffset>0x038</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000006</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TLPX</name>
                            <description>D-PHY T_TLPX Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000000. The write value should be 000000000000000000000000.</description>
                            <lsb>8</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM6_L</name>
                    <description>D-PHY Timing Control Register 6</description>
                    <alternateRegister>DPHYTIM6</alternateRegister>
                    <addressOffset>0x038</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0006</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TLPX</name>
                            <description>D-PHY T_TLPX Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPHYTIM6_LL</name>
                    <description>D-PHY Timing Control Register 6</description>
                    <alternateRegister>DPHYTIM6</alternateRegister>
                    <addressOffset>0x038</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x06</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TLPX</name>
                            <description>D-PHY T_TLPX Parameter Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
