ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>CDOCR_B</name>
                    <description>Capture Data Output Control Register</description>
                    <addressOffset>0x1064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>COBS</name>
                            <description>Controls swapping in 8-bit units for data output from the CEU.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data is not swapped in 8-bit units</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Data is swapped in 8-bit units</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>COWS</name>
                            <description>Controls swapping in 16-bit units for data output from the CEU.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data is not swapped in 16-bit units</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Data is swapped in 16-bit units</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>COLS</name>
                            <description>Controls swapping in 32-bit units for data output from the CEU.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data is not swapped in 32-bit units</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Data is swapped in 32-bit units</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CDS</name>
                            <description>Sets the image format when outputting the image data captured in the YCbCr422 format to the memory.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Converts the YCbCr422 format to the YCbCr420 format before outputting data to the memory</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Outputs data in the YCbCr422 format to the memory without conversion</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CBE</name>
                            <description>Controls the number of lines of captured data to be written to the memory.</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Normal write</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bundle write</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDAYR2_B</name>
                    <description>Capture Data Address Y Register 2</description>
                    <addressOffset>0x1090</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CAYR2</name>
                            <description>Capture Data Address Y</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDACR2_B</name>
                    <description>Capture Data Address C Register 2</description>
                    <addressOffset>0x1094</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CACR2</name>
                            <description>Capture Data Address C2</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDBYR2_B</name>
                    <description>Capture Data Bottom-Field Address Y Register 2</description>
                    <addressOffset>0x1098</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CBYR2</name>
                            <description>Set the address for storing the Y component data of the captured bottom-field data (4-pixel units).</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDBCR2_B</name>
                    <description>Capture Data Bottom-Field Address C Register 2</description>
                    <addressOffset>0x109C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CBCR2</name>
                            <description>Set the address for storing the C component data of the captured bottom-field data (4-pixel units).</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAMOR_M</name>
                    <description>Capture Interface Offset Register</description>
                    <addressOffset>0x2010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HOFST</name>
                            <description>Specify the capture start location in terms of the number of clock cycles from a horizontal sync signal (1-cycle units).</description>
                            <lsb>0</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VOFST</name>
                            <description>Specify the capture start location in terms of the HD count from a vertical sync signal (1-HD units).</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAPWR_M</name>
                    <description>Capture Interface Width Register</description>
                    <addressOffset>0x2014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HWDTH</name>
                            <description>Specify the horizontal capture period.</description>
                            <lsb>0</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VWDTH</name>
                            <description>Specify the vertical capture period (4-HD units).</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFLCR_M</name>
                    <description>Capture Filter Control Register</description>
                    <addressOffset>0x2030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HFRAC</name>
                            <description>Fraction Part of Horizontal Scale-Down Factor</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HMANT</name>
                            <description>Mantissa Part of Horizontal Scale-Down Factor</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VFRAC</name>
                            <description>Fraction Part of Vertical Scale-Down Factor</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VMANT</name>
                            <description>Mantissa Part of Vertical Scale-Down Factor</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFSZR_M</name>
                    <description>Capture Filter Size Clip Register</description>
                    <addressOffset>0x2034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>HFCLP</name>
                            <description>Specify the horizontal clipping value of the filter output size (4-pixel units).</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VFCLP</name>
                            <description>Set the vertical clipping value of the filter output size (4-pixel units).</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDWDR_M</name>
                    <description>Capture Destination Width Register</description>
                    <addressOffset>0x2038</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CHDW</name>
                            <description>Specify the horizontal image size in the memory area where the captured image is to be stored (4-byte units).</description>
                            <lsb>0</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDAYR_M</name>
                    <description>Capture Data Address Y Register</description>
                    <addressOffset>0x203C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CAYR</name>
                            <description>Capture Data Address Y</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDACR_M</name>
                    <description>Capture Data Address C Register</description>
                    <addressOffset>0x2040</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CACR</name>
                            <description>Capture Data Address C</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDBYR_M</name>
                    <description>Capture Data Bottom-Field Address Y Register</description>
                    <addressOffset>0x2044</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CBYR</name>
                            <description>Set the address for storing the Y (luminance) component data of the captured bottom-field data (4-pixel units).</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDBCR_M</name>
                    <description>Capture Data Bottom-Field Address C Register</description>
                    <addressOffset>0x2048</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CBCR</name>
                            <description>Set the address for storing the C (chrominance) component data of the captured bottom-field data (4-pixel units).</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CBDSR_M</name>
                    <description>Capture Bundle Destination Size Register</description>
                    <addressOffset>0x204C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CBVS</name>
                            <description>Select the number of lines or number of bytes for output to the memory in a bundle write.</description>
                            <lsb>0</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLFCR_M</name>
                    <description>Capture Low-Pass Filter Control Register</description>
                    <addressOffset>0x2060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LPF</name>
                            <description>Enables or disables operation of the low-pass filter.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Low-pass filter not used</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Low-pass filter used (only in the horizontal direction)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
