ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>CFCLR</name>
                    <description>Common Flag Clear Register</description>
                    <addressOffset>0x0068</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ERSC</name>
                            <description>ERS Clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000000.</description>
                            <lsb>5</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DCMFC</name>
                            <description>DCMF Clear bit</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DPERC</name>
                            <description>DPER Clear bit</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DFERC</name>
                            <description>DFER Clear bit</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000.</description>
                            <lsb>19</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ORERC</name>
                            <description>ORER Clear bit</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MFFC</name>
                            <description>MFF Clear bit</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PERC</name>
                            <description>PER Clear bit</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>FERC</name>
                            <description>FER Clear bit</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TDREC</name>
                            <description>TDRE Clear bit</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RDRFC</name>
                            <description>RDRF Clear bit</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFCLR_HA_L</name>
                    <description>Common Flag Clear Register</description>
                    <addressOffset>0x0068</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ERSC</name>
                            <description>ERS Clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000000.</description>
                            <lsb>5</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFCLR_BY_LL</name>
                    <description>Common Flag Clear Register</description>
                    <addressOffset>0x0068</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ERSC</name>
                            <description>ERS Clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFCLR_HA_H</name>
                    <description>Common Flag Clear Register</description>
                    <addressOffset>0x006A</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DCMFC</name>
                            <description>DCMF Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DPERC</name>
                            <description>DPER Clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DFERC</name>
                            <description>DFER Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ORERC</name>
                            <description>ORER Clear bit</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MFFC</name>
                            <description>MFF Clear bit</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PERC</name>
                            <description>PER Clear bit</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>FERC</name>
                            <description>FER Clear bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TDREC</name>
                            <description>TDRE Clear bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RDRFC</name>
                            <description>RDRF Clear bit</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFCLR_BY_HL</name>
                    <description>Common Flag Clear Register</description>
                    <addressOffset>0x006A</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DCMFC</name>
                            <description>DCMF Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DPERC</name>
                            <description>DPER Clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DFERC</name>
                            <description>DFER Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFCLR_BY_HH</name>
                    <description>Common Flag Clear Register</description>
                    <addressOffset>0x006B</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ORERC</name>
                            <description>ORER Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MFFC</name>
                            <description>MFF Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PERC</name>
                            <description>PER Clear bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>FERC</name>
                            <description>FER Clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TDREC</name>
                            <description>TDRE Clear bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RDRFC</name>
                            <description>RDRF Clear bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICFCLR</name>
                    <description>Simple-I2C Flag Clear Register</description>
                    <addressOffset>0x006C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IICBBSC</name>
                            <description>IICBBS Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IICSTIFC</name>
                            <description>IICSTIF Clear bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000000000000000000000000.</description>
                            <lsb>4</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICFCLR_HA_L</name>
                    <description>Simple-I2C Flag Clear Register</description>
                    <addressOffset>0x006C</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IICBBSC</name>
                            <description>IICBBSC Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IICSTIFC</name>
                            <description>IICSTIF Clear bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000000000000.</description>
                            <lsb>4</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICFCLR_BY_LL</name>
                    <description>Simple-I2C Flag Clear Register</description>
                    <addressOffset>0x006C</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IICBBSC</name>
                            <description>IICBBSC Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IICSTIFC</name>
                            <description>IICSTIF Clear bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000.</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
