ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>FFCLR</name>
                    <description>FIFO Flag Clear Register</description>
                    <addressOffset>0x0070</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DRC</name>
                            <description>DR Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BRKC</name>
                            <description>BRK Clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000000000000000000000000000000.</description>
                            <lsb>2</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FFCLR_HA_L</name>
                    <description>FIFO Flag Clear Register</description>
                    <addressOffset>0x0070</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DRC</name>
                            <description>DR Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BRKC</name>
                            <description>BRK Clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000000000.</description>
                            <lsb>2</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FFCLR_BY_LL</name>
                    <description>FIFO Flag Clear Register</description>
                    <addressOffset>0x0070</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DRC</name>
                            <description>DR Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BRKC</name>
                            <description>BRK Clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000000.</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MFCLR</name>
                    <description>Manchester Flag Clear Register</description>
                    <addressOffset>0x0074</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PFERC</name>
                            <description>PFER Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SYERC</name>
                            <description>SYER Clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SBERC</name>
                            <description>SBER Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MERC</name>
                            <description>MER Clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000000000000000000000000000.</description>
                            <lsb>5</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MFCLR_HA_L</name>
                    <description>Manchester Flag Clear Register</description>
                    <addressOffset>0x0074</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PFERC</name>
                            <description>PFER Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SYERC</name>
                            <description>SYER Clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SBERC</name>
                            <description>SBER Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MERC</name>
                            <description>MER Clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000000.</description>
                            <lsb>5</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MFCLR_BY_LL</name>
                    <description>Manchester Flag Clear Register</description>
                    <addressOffset>0x0074</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>PFERC</name>
                            <description>PFER Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SYERC</name>
                            <description>SYER Clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SBERC</name>
                            <description>SBER Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MERC</name>
                            <description>MER Clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XFCLR</name>
                    <description>Simpe-LIN(SCIX) Flag Clear Register</description>
                    <addressOffset>0x0078</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BFOC</name>
                            <description>BFO Clear bit</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCDC</name>
                            <description>BCD Clear bit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BFDC</name>
                            <description>BFD Clear bit</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CF0MC</name>
                            <description>CF0M Clear bit</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CF1MC</name>
                            <description>CF1M Clear bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIBDC</name>
                            <description>PIBD Clear bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COFC</name>
                            <description>COF Clear bit</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>AEDC</name>
                            <description>AED Clear bit</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XFCLR_HA_L</name>
                    <description>Simpe-LIN(SCIX) Flag Clear Register</description>
                    <addressOffset>0x0078</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 00000000.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BFOC</name>
                            <description>BFO Clear bit</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCDC</name>
                            <description>BCD Clear bit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BFDC</name>
                            <description>BFD Clear bit</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CF0MC</name>
                            <description>CF0M Clear bit</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CF1MC</name>
                            <description>CF1M Clear bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIBDC</name>
                            <description>PIBD Clear bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COFC</name>
                            <description>COF Clear bit</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>AEDC</name>
                            <description>AED Clear bit</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XFCLR_BY_LH</name>
                    <description>Simpe-LIN(SCIX) Flag Clear Register</description>
                    <addressOffset>0x0079</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>BFOC</name>
                            <description>BFO Clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BCDC</name>
                            <description>BCD Clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BFDC</name>
                            <description>BFD Clear bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CF0MC</name>
                            <description>CF0M Clear bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CF1MC</name>
                            <description>CF1M Clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PIBDC</name>
                            <description>PIBD Clear bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COFC</name>
                            <description>COF Clear bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>AEDC</name>
                            <description>AED Clear bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
