ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>SPPSR</name>
                    <description>RSPI Poling status regster</description>
                    <addressOffset>0x060</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SPEPS</name>
                            <description>SPE poling status regster</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000.</description>
                            <lsb>1</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPSRC</name>
                    <description>RSPI Status Clear Register</description>
                    <addressOffset>0x068</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>16</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPDRFC</name>
                            <description>Rx data ready flag clear bit</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OVRFC</name>
                            <description>Clear overrun error flag(Initial value: 1'b0)</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODFC</name>
                            <description>Mode fault error clear(Initial value: 1'b0)</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PERFC</name>
                            <description>Clear parity error flag(Initial value: 1'b0)</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>UDRFC</name>
                            <description>Underrun error flag clear(Initial value: 1'b0)</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SPTEFC</name>
                            <description>Send bufferEmpty flag clear(Initial value: 1'b0)</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CENDFC</name>
                            <description>Clear communication complete flag(Initial value: 1'b0)</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SPRFC</name>
                            <description>Clear receive buffer full flag(Initial value: 1'b0)</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPFCR</name>
                    <description>RSPI FIFO clear register</description>
                    <addressOffset>0x06C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SPFRST</name>
                            <description>RSPI FIFO clear bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000. The write value should be 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
