ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>HTIE_BY_LL</name>
                    <description>High Priority Transfer Interrupt Enable Register</description>
                    <addressOffset>0x208</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TDBEIE</name>
                            <description>High Priority Tx Data Buffer Empty Interrupt Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables High Priority Tx Data Buffer Empty Interrupt Signal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables High Priority Tx Data Buffer Empty Interrupt Signal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RDBFIE</name>
                            <description>High Priority Rx Data Buffer Full Interrupt Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables High Priority Rx Data Buffer Full Interrupt Signal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables High Priority Rx Data Buffer Full Interrupt Signal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMDQEIE</name>
                            <description>High Priority Command Queue Empty Interrupt Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables High Priority Command Buffer Empty Interrupt Signal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables High Priority Command Buffer Empty Interrupt Signal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPQFIE</name>
                            <description>High Priority Response Queue Full Interrupt Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables High Priority Response Buffer Full Interrupt Signal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables High Priority Response Buffer Full Interrupt Signal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TABTIE</name>
                            <description>High Priority Transfer Abort Interrupt Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables High Priority Transfer Abort interrupt Signal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables High Priority Transfer Abort interrupt Signal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HTIE_BY_LH</name>
                    <description>High Priority Transfer Interrupt Enable Register</description>
                    <addressOffset>0x209</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TEIE</name>
                            <description>High Priority Transfer Error Interrupt Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disables High Priority Transfer Error Interrupt Signal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enables High Priority Transfer Error Interrupt Signal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HTSTFC</name>
                    <description>High Priority Transfer Status Force Register</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDBEFC</name>
                            <description>High Priority Tx Data Buffer Empty Force</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force High Priority Tx Data Buffer Empty Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force High Priority Tx Data Buffer Empty Interrupt for software</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RDBFFC</name>
                            <description>High Priority Rx Data Buffer Full Force</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force High Priority Rx Data Buffer Full Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force High Priority Rx Data Buffer Full Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMDQEFC</name>
                            <description>High Priority Command Queue Empty Force</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force High Priority Command Buffer Empty Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force High Priority Command Buffer Empty Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPQFFC</name>
                            <description>High Priority Response Queue Full Force</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force High Priority Response Buffer Full Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force High Priority Response Buffer Full Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TABTFC</name>
                            <description>High Priority Transfer Abort Force</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force High Priority Transfer Abort Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force High Priority Transfer Abort Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 000.</description>
                            <lsb>6</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TEFC</name>
                            <description>High Priority Transfer Error Force</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>not Force High Priority Transfer Error Interrupt for software testing.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Force High Priority Transfer Error Interrupt for software testing.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>The write value should be 0000000000000000000000.</description>
                            <lsb>10</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
