ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>CETSM_HA_L</name>
                    <description>CCC Exchange Timing Support Information M(Mode ) Register</description>
                    <addressOffset>0x374</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SPTSYN</name>
                            <description>Supports Sync Mode</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable Supports Sync Mode.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable Supports Sync Mode.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPTASYN0</name>
                            <description>Supports Async Mode 0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Async Mode 0 is not supported.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Async Mode 0 is supported.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPTASYN1</name>
                            <description>Supports Async Mode 1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Async Mode 1 is not supported.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Async Mode 1 is supported.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FREQ</name>
                            <description>Frequency ByteThis byte represents the Slave's internal oscillator frequency in increments of 0.5 MHz (500 kHz), up to 127.5 MHz.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>32.0KHz</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>:   7.5MHz</description>
                                    <value>0x0F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>15.5MHz</description>
                                    <value>0x1F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2F</name>
                                    <description>23.5MHz</description>
                                    <value>0x2F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3F</name>
                                    <description>31.5MHz</description>
                                    <value>0x3F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4F</name>
                                    <description>39.5MHz</description>
                                    <value>0x4F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5F</name>
                                    <description>47.5MHz</description>
                                    <value>0x5F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6F</name>
                                    <description>55.5MHz</description>
                                    <value>0x6F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7F</name>
                                    <description>63.5MHz</description>
                                    <value>0x7F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8F</name>
                                    <description>71.5MHz</description>
                                    <value>0x8F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9F</name>
                                    <description>79.5MHz</description>
                                    <value>0x9F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xAF</name>
                                    <description>87.5MHz</description>
                                    <value>0xAF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xBF</name>
                                    <description>95.5MHz</description>
                                    <value>0xBF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xCF</name>
                                    <description>103.5MHz</description>
                                    <value>0xCF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xDF</name>
                                    <description>111.5MHz</description>
                                    <value>0xDF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xEF</name>
                                    <description>119.5MHz</description>
                                    <value>0xEF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xFF</name>
                                    <description>127.5MHz</description>
                                    <value>0xFF</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CETSM_BY_LL</name>
                    <description>CCC Exchange Timing Support Information M(Mode ) Register</description>
                    <addressOffset>0x374</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SPTSYN</name>
                            <description>Supports Sync Mode</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable Supports Sync Mode.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable Supports Sync Mode.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPTASYN0</name>
                            <description>Supports Async Mode 0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Async Mode 0 is not supported.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Async Mode 0 is supported.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPTASYN1</name>
                            <description>Supports Async Mode 1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Async Mode 1 is not supported.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Async Mode 1 is supported.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CETSM_BY_LH</name>
                    <description>CCC Exchange Timing Support Information M(Mode ) Register</description>
                    <addressOffset>0x375</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FREQ</name>
                            <description>Frequency ByteThis byte represents the Slave's internal oscillator frequency in increments of 0.5 MHz (500 kHz), up to 127.5 MHz.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>32.0KHz</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>:   7.5MHz</description>
                                    <value>0x0F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>15.5MHz</description>
                                    <value>0x1F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2F</name>
                                    <description>23.5MHz</description>
                                    <value>0x2F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3F</name>
                                    <description>31.5MHz</description>
                                    <value>0x3F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4F</name>
                                    <description>39.5MHz</description>
                                    <value>0x4F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5F</name>
                                    <description>47.5MHz</description>
                                    <value>0x5F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6F</name>
                                    <description>55.5MHz</description>
                                    <value>0x6F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7F</name>
                                    <description>63.5MHz</description>
                                    <value>0x7F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8F</name>
                                    <description>71.5MHz</description>
                                    <value>0x8F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9F</name>
                                    <description>79.5MHz</description>
                                    <value>0x9F</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xAF</name>
                                    <description>87.5MHz</description>
                                    <value>0xAF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xBF</name>
                                    <description>95.5MHz</description>
                                    <value>0xBF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xCF</name>
                                    <description>103.5MHz</description>
                                    <value>0xCF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xDF</name>
                                    <description>111.5MHz</description>
                                    <value>0xDF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xEF</name>
                                    <description>119.5MHz</description>
                                    <value>0xEF</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xFF</name>
                                    <description>127.5MHz</description>
                                    <value>0xFF</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
