ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <name>NQSTLV_BY_LL</name>
                    <description>Normal Queue Status Level Register</description>
                    <addressOffset>0x394</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x08</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDQFLV</name>
                            <description>Normal Command Queue Free LevelNumber of free buffer entries currently in the Command Queue. Reset value is the depth of the Command Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NQSTLV_BY_LH</name>
                    <description>Normal Queue Status Level Register</description>
                    <addressOffset>0x395</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RSPQLV</name>
                            <description>Normal Response Queue LevelNumber of buffer entries currently in the Response Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NQSTLV_HA_H</name>
                    <description>Normal Queue Status Level Register</description>
                    <addressOffset>0x396</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IBIQLV</name>
                            <description>Normal IBI Queue Level  Number of buffer entries currently in the IBI Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IBISCNT</name>
                            <description>Normal IBI Status CountNumber of IBI Status entries currently in the IBI Queue.</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000.</description>
                            <lsb>13</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NQSTLV_BY_HL</name>
                    <description>Normal Queue Status Level Register</description>
                    <addressOffset>0x396</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>IBIQLV</name>
                            <description>Normal IBI Queue Level  Number of buffer entries currently in the IBI Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NQSTLV_BY_HH</name>
                    <description>Normal Queue Status Level Register</description>
                    <addressOffset>0x397</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>IBISCNT</name>
                            <description>Normal IBI Status CountNumber of IBI Status entries currently in the IBI Queue.</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000.</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDBSTLV0</name>
                    <description>Normal Data Buffer Status Level Register 0</description>
                    <addressOffset>0x398</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDBFLV</name>
                            <description>Normal Tx Data Buffer Free LevelIndicates the number of free Tx Data Buffer entries in the Tx Data Queue.Reset value is the depth of the Tx Data Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDBLV</name>
                            <description>Normal Rx Data Buffer LevelIndicates the number of Rx Data Buffer entries in the Rx Data Queue.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDBSTLV0_HA_L</name>
                    <description>Normal Data Buffer Status Level Register 0</description>
                    <addressOffset>0x398</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0001</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDBFLV</name>
                            <description>Normal Tx Data Buffer Free LevelIndicates the number of free Tx Data Buffer entries in the Tx Data Queue.Reset value is the depth of the Tx Data Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDBLV</name>
                            <description>Normal Rx Data Buffer LevelIndicates the number of Rx Data Buffer entries in the Rx Data Queue.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDBSTLV0_BY_LL</name>
                    <description>Normal Data Buffer Status Level Register 0</description>
                    <addressOffset>0x398</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TDBFLV</name>
                            <description>Normal Tx Data Buffer Free LevelIndicates the number of free Tx Data Buffer entries in the Tx Data Queue.Reset value is the depth of the Tx Data Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDBSTLV0_BY_LH</name>
                    <description>Normal Data Buffer Status Level Register 0</description>
                    <addressOffset>0x399</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RDBLV</name>
                            <description>Normal Rx Data Buffer LevelIndicates the number of Rx Data Buffer entries in the Rx Data Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NRSQSTLV</name>
                    <description>Normal Receive Status Queue Status Level Register</description>
                    <addressOffset>0x3C0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RSQLV</name>
                            <description>Normal Receive Status Queue Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000000000000.</description>
                            <lsb>8</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NRSQSTLV_HA_L</name>
                    <description>Normal Receive Status Queue Status Level Register</description>
                    <addressOffset>0x3C0</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RSQLV</name>
                            <description>Normal Receive Status Queue Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NRSQSTLV_BY_LL</name>
                    <description>Normal Receive Status Queue Status Level Register</description>
                    <addressOffset>0x3C0</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RSQLV</name>
                            <description>Normal Receive Status Queue Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HQSTLV</name>
                    <description>High Priority Queue Status Level Register</description>
                    <addressOffset>0x3C4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDQLV</name>
                            <description>High Priority Command Queue LevelNumber of free buffer entries currently in the High Priority Command Queue. Reset value is the depth of the High Priority Command Queue</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSPQLV</name>
                            <description>High Priority Response Queue LevelNumber of buffer entries currently in the High Priority Response Queue. Data Queue.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HQSTLV_HA_L</name>
                    <description>High Priority Queue Status Level Register</description>
                    <addressOffset>0x3C4</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0002</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDQLV</name>
                            <description>High Priority Command Queue LevelNumber of free buffer entries currently in the High Priority Command Queue. Reset value is the depth of the High Priority Command Queue</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSPQLV</name>
                            <description>High Priority Response Queue LevelNumber of buffer entries currently in the High Priority Response Queue. Data Queue.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HQSTLV_BY_LL</name>
                    <description>High Priority Queue Status Level Register</description>
                    <addressOffset>0x3C4</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x02</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDQLV</name>
                            <description>High Priority Command Queue LevelNumber of free buffer entries currently in the High Priority Command Queue. Reset value is the depth of the High Priority Command Queue</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HQSTLV_BY_LH</name>
                    <description>High Priority Queue Status Level Register</description>
                    <addressOffset>0x3C5</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RSPQLV</name>
                            <description>High Priority Response Queue LevelNumber of buffer entries currently in the High Priority Response Queue. Data Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDBSTLV</name>
                    <description>High Priority Data Buffer Status Level Register</description>
                    <addressOffset>0x3C8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000004</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDBFLV</name>
                            <description>High Priority Tx Data Buffer Free LevelIndicates the number of free High Priority Tx Data Buffer entries in the High Priority Tx Data Queue.Reset value is the depth of the High Priority Tx Data Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDBLV</name>
                            <description>High Priority Rx Data Buffer Level Indicates the number of High Priority Rx Data Buffer entries in the High Priority Rx Data Queue.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDBSTLV_HA_L</name>
                    <description>High Priority Data Buffer Status Level Register</description>
                    <addressOffset>0x3C8</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0004</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDBFLV</name>
                            <description>High Priority Tx Data Buffer Free LevelIndicates the number of free High Priority Tx Data Buffer entries in the High Priority Tx Data Queue.Reset value is the depth of the High Priority Tx Data Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDBLV</name>
                            <description>High Priority Rx Data Buffer Level Indicates the number of High Priority Rx Data Buffer entries in the High Priority Rx Data Queue.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDBSTLV_BY_LL</name>
                    <description>High Priority Data Buffer Status Level Register</description>
                    <addressOffset>0x3C8</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x04</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TDBFLV</name>
                            <description>High Priority Tx Data Buffer Free LevelIndicates the number of free High Priority Tx Data Buffer entries in the High Priority Tx Data Queue.Reset value is the depth of the High Priority Tx Data Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDBSTLV_BY_LH</name>
                    <description>High Priority Data Buffer Status Level Register</description>
                    <addressOffset>0x3C9</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RDBLV</name>
                            <description>High Priority Rx Data Buffer Level Indicates the number of High Priority Rx Data Buffer entries in the High Priority Rx Data Queue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
