ra-rs/ra/svd/vendor/R7FA8D1BH.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="ECCMB0">
            <name>ECCMB1</name>
            <description>Error correction circuit for MBRAM1</description>
            <groupName>groupName_x0020_</groupName>
            <baseAddress>0x4036F300</baseAddress>
        </peripheral>
        <peripheral>
            <name>CANFD0</name>
            <description>CANFD Module 0</description>
            <groupName>groupName_x0020_</groupName>
            <baseAddress>0x40380000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>220</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>608</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x520</offset>
                <size>540</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x740</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x920</offset>
                <size>616</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD20</offset>
                <size>616</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1120</offset>
                <size>616</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1520</offset>
                <size>616</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1920</offset>
                <size>228</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CFDC0NCFG</name>
                    <description>Channel 0 Nominal Bitrate Configuration Register</description>
                    <addressOffset>0x0000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NBRP</name>
                            <description>Channel Nominal Baud Rate Prescaler</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NSJW</name>
                            <description>Resynchronization Jump Width</description>
                            <lsb>10</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000000</name>
                                    <description>1Tq</description>
                                    <value>#0000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000001</name>
                                    <description>2Tq</description>
                                    <value>#0000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000010</name>
                                    <description>3Tq</description>
                                    <value>#0000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000011</name>
                                    <description>4Tq</description>
                                    <value>#0000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111110</name>
                                    <description>127 Tq</description>
                                    <value>#1111110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111111</name>
                                    <description>128 Tq</description>
                                    <value>#1111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NTSEG1</name>
                            <description>Timing Segment 1</description>
                            <lsb>17</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000000</name>
                                    <description>Reserved</description>
                                    <value>#00000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00000001</name>
                                    <description>2Tq</description>
                                    <value>#00000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000000010</name>
                                    <description>3Tq</description>
                                    <value>#000000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000000011</name>
                                    <description>4Tq</description>
                                    <value>#000000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11111110</name>
                                    <description>255 Tq</description>
                                    <value>#11111110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11111111</name>
                                    <description>256 Tq</description>
                                    <value>#11111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NTSEG2</name>
                            <description>Timing Segment 2</description>
                            <lsb>25</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000000</name>
                                    <description>Reserved</description>
                                    <value>#0000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000001</name>
                                    <description>2Tq</description>
                                    <value>#0000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000010</name>
                                    <description>3Tq</description>
                                    <value>#0000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0000011</name>
                                    <description>4Tq</description>
                                    <value>#0000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111110</name>
                                    <description>127 Tq</description>
                                    <value>#1111110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111111</name>
                                    <description>128 Tq</description>
                                    <value>#1111111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
