ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0010</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDGAFLP0%s</name>
                    <description>Global Acceptance Filter List Pointer 0 Registers r = [1...10]h</description>
                    <addressOffset>0x0128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GAFLDLC</name>
                            <description>Global Acceptance Filter List DLC Field</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLIFL0</name>
                            <description>Global Acceptance Filter List Information Label 0</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLRMDP</name>
                            <description>Global Acceptance Filter List RX Message Buffer Direction Pointer</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>13</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLRMV</name>
                            <description>Global Acceptance Filter List RX Message Buffer Valid</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Global Acceptance Filter List Single Message Buffer Direction Pointer is invalid</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Global Acceptance Filter List  Single Message Buffer Direction Pointer is valid</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GAFLPTR</name>
                            <description>Global Acceptance Filter List Pointer Field</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RTR bit is not considered for ID matching</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RTR bit is considered for ID matching</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0010</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDGAFLP1%s</name>
                    <description>Global Acceptance Filter List Pointer 1 Registers r = [1...10]h</description>
                    <addressOffset>0x012C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GAFLFDP0</name>
                            <description>Global Acceptance Filter List FIFO Direction Pointer (GAFLFDP[0])</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLFDP1</name>
                            <description>Global Acceptance Filter List FIFO Direction Pointer (GAFLFDP[1])</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GAFLFDP8</name>
                            <description>Global Acceptance Filter List FIFO Direction Pointer (GAFLFDP[8])</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000000000000. The write value should be 00000000000000000000000.</description>
                            <lsb>9</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x0024</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>CFDGPFLID%s</name>
                    <description>Global Pretended Network Filter List ID Registers s = [1…2]h </description>
                    <addressOffset>0x0220</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GPFLID</name>
                            <description>Global Pretended Network Filter List ID Field</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPFLLB</name>
                            <description>Global Pretended Network Filter List Entry Loopback Configuration</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Global Pretended Network Filter List entry ID for acceptance filtering has attribute ‘RX’</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Global Pretended Network Filter List entry ID for acceptance filtering has attribute ‘TX’</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GPFLRTR</name>
                            <description>Global Pretended Network Filter List Entry RTR Field</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GPFLIDE</name>
                            <description>Global Pretended Network Filter List IDE Field</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Standard Identifier of Rule entry ID is valid for acceptance filtering</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Extended Identifier of Rule entry ID is valid for acceptance filtering</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x0024</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>CFDGPFLM%s</name>
                    <description>Global Pretended Network Filter List MASK Registers s = [1…2]h </description>
                    <addressOffset>0x0224</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GPFLIDM</name>
                            <description>Global Pretended Network Filter List ID Mask Field</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPFLIFL1</name>
                            <description>Global Pretended Network Filter List Information Label 1</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPFLRTRM</name>
                            <description>Global Pretended Network Filter List Entry RTR Mask</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RTR bit is not considered for ID matching</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RTR bit is considered for ID matching</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GPFLIDEM</name>
                            <description>Global Pretended Network Filter List IDE Mask</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>IDE bit is not considered for ID matching</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>IDE bit is considered for ID matching</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x0024</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>CFDGPFLP0%s</name>
                    <description>Global Pretended Network Filter List Pointer 0 Registers s = [1…2]h </description>
                    <addressOffset>0x0228</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GPFLDLC</name>
                            <description>Global Pretended Network Filter List DLC Field</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPFLIFL0</name>
                            <description>Global Pretended Network Filter List Information Label 0</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPFLRMDP</name>
                            <description>Global Pretended Network Filter List RX Message Buffer Direction Pointer</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>13</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPFLRMV</name>
                            <description>Global Pretended Network Filter List RX Message Buffer Valid</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Global Pretended Network Filter List Single Message Buffer Direction Pointer is invalid</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Global Pretended Network Filter List Single Message Buffer Direction Pointer is valid</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GPFLPTR</name>
                            <description>Global Pretended Network Filter List Pointer Field</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x0024</dimIncrement>
                    <dimIndex>1-2</dimIndex>
                    <name>CFDGPFLP1%s</name>
                    <description>Global Pretended Network Filter List Pointer 1 Registers s = [1…2]h </description>
                    <addressOffset>0x022C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GPFLFDP0</name>
                            <description>Global Pretended Network Filter List FIFO Direction Pointer [0]</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPFLFDP1</name>
                            <description>Global Pretended Network Filter List FIFO Direction Pointer [1]</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000. The write value should be 000000.</description>
                            <lsb>2</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPFLFDP8</name>
                            <description>Global Pretended Network Filter List FIFO Direction Pointer [8]</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000000000000000. The write value should be 00000000000000000000000.</description>
                            <lsb>9</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
