ra-rs/ra/svd/vendor/R7FA8D1BH.svd
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF0_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x092C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB0</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB1</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB2</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB3</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF1_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x0978</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB4</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB5</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB6</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB7</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF2_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x09C4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB8</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB9</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB10</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB11</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF3_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x0A10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB12</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB13</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB14</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB15</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF4_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x0A5C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB16</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB17</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB18</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB19</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>16</dim>
                    <dimIncrement>0x0004</dimIncrement>
                    <dimIndex>0-15</dimIndex>
                    <name>CFDRMDF5_%s</name>
                    <description>RX Message Buffer Data Field p Registers</description>
                    <addressOffset>0x0AA8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RMDB20</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-4))</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RMDB21</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-3))</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB22</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-2))</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RMDB23</name>
                            <description>RX Message Buffer Data Byte ((p*q)+(q-1))</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data Frame</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Remote Frame</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
