ra-rs/ra/svd/vendor/R7FA8D1BH.svd
        <peripheral derivedFrom="PORT0">
            <name>PORT5_NS</name>
            <description>Port 5 Control Registers as Non-secure</description>
            <baseAddress>0x504000A0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT6_NS</name>
            <description>Port 6 Control Registers as Non-secure</description>
            <baseAddress>0x504000C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT7_NS</name>
            <description>Port 7 Control Registers as Non-secure</description>
            <baseAddress>0x504000E0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT8_NS</name>
            <description>Port 8 Control Registers as Non-secure</description>
            <baseAddress>0x50400100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT9_NS</name>
            <description>Port 9 Control Registers as Non-secure</description>
            <baseAddress>0x50400120</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORTA_NS</name>
            <description>Port A Control Registers as Non-secure</description>
            <baseAddress>0x50400140</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORTB_NS</name>
            <description>Port B Control Registers as Non-secure</description>
            <baseAddress>0x50400160</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORTC_NS</name>
            <description>Port C Control Registers as Non-secure</description>
            <baseAddress>0x50400180</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORTD_NS</name>
            <description>Port D Control Registers as Non-secure</description>
            <baseAddress>0x504001A0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORTE_NS</name>
            <description>Port E Control Registers as Non-secure</description>
            <baseAddress>0x504001C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORTF_NS</name>
            <description>Port F Control Registers as Non-secure</description>
            <baseAddress>0x504001E0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORTG_NS</name>
            <description>Port G Control Registers as Non-secure</description>
            <baseAddress>0x50400200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PFS">
            <name>PFS_NS</name>
            <description>Pmn Pin Function Control Register as Non-secure</description>
            <baseAddress>0x50400800</baseAddress>
        </peripheral>
    </peripherals>
</device>
